Public Attributes | List of all members
API_AnalyticalSupportGeometry Struct Reference
Analytical Model
Describes a Structural Analytical Model Analytical Support Geometry. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 GS::Array< API_Coord3D >  | coordinates
Positions of the analytical support.
 API_Vector3D  | translationStiffnessVector
Support's translation stiffness vector in the start member's coordinate system.
 API_Vector3D  | rotationStiffnessVector
Support's rotation stiffness vector in the start member's coordinate system.
Detailed Description
Describes a Structural Analytical Model Analytical Support Geometry.
Since
Archicad 25